package com.bezsden.tasks;

public abstract class Test {
//    Условие: даны две коллекции
// коллекция строк Arrays.asList(«a1», «a4», «a3», «a2», «a1», «a4»)
// и коллекция людей класса People (с полями name — имя, age — возраст, sex — пол),
// вида Arrays.asList( new People(«Вася», 16, Sex.MAN), new People(«Петя», 23, Sex.MAN),
// new People(«Елена», 42, Sex.WOMEN), new People(«Иван Иванович», 69, Sex.MAN))
//    Задача	Ожидаемый результат
//    Отсортировать коллекцию строк по алфавиту	[a1, a1, a2, a3, a4, a4]
//    Отсортировать коллекцию строк по алфавиту в обратном порядке	[a4, a4, a3, a2, a1, a1]
//    Отсортировать коллекцию строк по алфавиту и убрать дубликаты	[a1, a2, a3, a4]
//    Отсортировать коллекцию строк по алфавиту в обратном порядке и убрать дубликаты	[a4, a3, a2, a1]
//    Отсортировать коллекцию людей по имени в обратном алфавитном порядке	[{'Петя'}, {'Иван Иванович'}, {'Елена'}, {'Вася'}]
//    Отсортировать коллекцию людей сначала по полу, а потом по возрасту	[{'Вася'}, {'Петя'}, {'Иван Иванович'}, {'Елена'}]
}
